import assign from './utils/assign'
//@formatter:off
/**
 * 全局通用配置信息，适用于chart目录下所有图表。
 */
const config = {
    color: [
        '#2fc25b', '#3aa1ff', '#13c2c2', '#d64700',
        '#8543e0', '#ff5879', '#047878', "#570026",
        '#8db500', '#00293e', '#f1baf3', '#ff006d'],

    /**
     * 配置过程图表的分区颜色：历史时区、短临预报时区、中长期预报时区、未来预报时区
     */
    areaColor: {
        history: "rgba(222,222,222,0.35)",
        short: "rgba(031,138,112,0.35)",
        long: "rgba(255,225,026,0.35)",
        trend: "rgba(240,150,020,0.35)",
        forecast: "rgba(240,150,020,0.35)",
    },
    /**
     * 指标颜色
     */
    indexColor: {
        1: "#dc2828",
        2: "#f09614",
        3: "#fae600",
        4: "#3764ff"
    },

    /**
     * 标记颜色（主要是标记线）
     */
    markColor: {
        safe: "#4cc053",
        [-2]: "#111", // 历史最高/最低[水位/流量/...]
        [-1]: "#666", // 死水位
        0: "#14af06", // 正常[水位/流量/...]
        1: "#0984ff", // 当前/4级[水位/流量/...]
        2: "#fae600", // 3级[防洪高水位]
        3: "#f09614", // 2级[防洪限制水位]
        4: "#dc2828", // 1级[设计洪水位]
        5: "#8d04d7"  // 特级[校核水位]
    },

    /**
     * 降雨量柱状图颜色
     */
    rainfallColor: ["#0984ff", "#37c9ff", "#7bcbff", "#54b2ff"],

    icon: {
        stage: "M9,18.12.26,1.42A1,1,0,0,1,1.15,0H18.64a1,1,0,0,1,.89,1.42l-8.75,16.7A1,1,0,0,1,9,18.12Zm187,.82a.49.49,0,0,0-.5-.49H.5a.49.49,0,1,0,0,1h195A.49.49,0,0,0,196,18.94ZM17.31,22.46a.49.49,0,0,0-.5-.49H3a.49.49,0,1,0,0,1H16.81A.49.49,0,0,0,17.31,22.46ZM14.78,26a.49.49,0,0,0-.5-.49H5.51a.49.49,0,1,0,0,1h8.77A.49.49,0,0,0,14.78,26Zm-2.19,3.52a.5.5,0,0,0-.5-.49H7.7a.49.49,0,1,0,0,1h4.39A.5.5,0,0,0,12.59,29.51Z",
        stageMirror: "M185.22,18.12l-8.75-16.7A1,1,0,0,1,177.36,0h17.49a1,1,0,0,1,.89,1.42L187,18.12A1,1,0,0,1,185.22,18.12ZM.5,19.43h195a.49.49,0,1,0,0-1H.5a.49.49,0,1,0,0,1ZM179.19,23H193a.49.49,0,0,0,0-1H179.19a.49.49,0,1,0,0,1Zm2.53,3.53h8.77a.49.49,0,1,0,0-1h-8.77a.49.49,0,1,0,0,1ZM183.91,30h4.39a.49.49,0,1,0,0-1h-4.39a.49.49,0,1,0,0,1Z",
        altitude: "M195.5,18H10.85l8.5-16.55A1,1,0,0,0,18.46,0H1A1,1,0,0,0,.11,1.45l8.73,17a1,1,0,0,0,1,.53H195.5a.5.5,0,0,0,.5-.5A.5.5,0,0,0,195.5,18Z",
        altitudeMirror: "M.5,18H185.15l-8.5-16.55A1,1,0,0,1,177.54,0H195a1,1,0,0,1,.89,1.45l-8.73,17a1,1,0,0,1-1,.53H.5a.5.5,0,0,1-.5-.5A.5.5,0,0,1,.5,18Z",
        zoom: "M10.7,11.9H9.3c-4.9,0.3-8.8,4.4-8.8,9.4c0,5,3.9,9.1,8.8,9.4h1.3c4.9-0.3,8.8-4.4,8.8-9.4C19.5,16.3,15.6,12.2,10.7,11.9z M13.3,24.4H6.7v-1.2h6.6z M13.3,22H6.7v-1.2h6.6z M13.3,19.6H6.7v-1.2h6.6z",
        save: "M968.96 268.373333a42.666667 42.666667 0 0 0-60.586667 0L853.333333 323.84V85.333333a42.666667 42.666667 0 0 0-85.333333 0v238.506667l-55.04-55.466667a42.666667 42.666667 0 0 0-60.586667 60.586667l128 128a42.666667 42.666667 0 0 0 14.08 8.96 40.106667 40.106667 0 0 0 32.426667 0 42.666667 42.666667 0 0 0 14.08-8.96l128-128a42.666667 42.666667 0 0 0 0-60.586667zM810.666667 554.666667a42.666667 42.666667 0 0 0-42.666667 42.666666v16.213334l-63.146667-63.146667a119.04 119.04 0 0 0-167.68 0l-29.866666 29.866667-105.813334-105.813334a121.6 121.6 0 0 0-167.68 0L170.666667 537.6V298.666667a42.666667 42.666667 0 0 1 42.666666-42.666667h341.333334a42.666667 42.666667 0 0 0 0-85.333333H213.333333a128 128 0 0 0-128 128v512a128 128 0 0 0 128 128h512a128 128 0 0 0 128-128v-213.333334a42.666667 42.666667 0 0 0-42.666666-42.666666zM213.333333 853.333333a42.666667 42.666667 0 0 1-42.666666-42.666666v-152.32l123.733333-123.733334a33.706667 33.706667 0 0 1 46.506667 0l135.253333 135.253334 183.466667 183.466666z m554.666667-42.666666a37.973333 37.973333 0 0 1-7.68 22.613333L567.893333 640l29.866667-29.866667a32.853333 32.853333 0 0 1 46.933333 0L768 734.293333z",
        statistics: "m22,0c-12.15,0-22,9.85-22,22s9.85,22 22,22 22-9.85 22-22-9.85-22-22-22zm10.975,38.71l-10.118-17.231-.017,.011c-0.176-0.288-0.479-0.49-0.84-0.49-0.552,0-1,0.447-1,1 0,0.175 0.057,0.33 0.135,0.473l-.01,.006 10.125,17.244c-2.768,1.447-5.91,2.277-9.25,2.277-11.046,0-20-8.954-20-20s8.954-20 20-20c11.045,0 20,8.954 20,20 0,6.99-3.592,13.135-9.025,16.71z M36.142,6.529L23,19.56V1h-2v21c0,0.553,0.448,1,1,1c0.328,0,0.606-0.169,0.788-0.413L37.556,7.943L36.142,6.529z",
        tabulation: "M15,14 L15,10 L9,10 L9,14 L15,14 Z M15,15 L9,15 L9,19 L15,19 L15,15 Z M4,14 L8,14 L8,10 L4,10 L4,14 Z M4,15 L4,17.5 C4,18.3284271 4.67157288,19 5.5,19 L8,19 L8,15 L4,15 Z M20,14 L20,10 L16,10 L16,14 L20,14 Z M20,15 L16,15 L16,19 L18.5,19 C19.3284271,19 20,18.3284271 20,17.5 L20,15 Z M15,9 L15,5 L9,5 L9,9 L15,9 Z M4,9 L8,9 L8,5 L5.5,5 C4.67157288,5 4,5.67157288 4,6.5 L4,9 Z M20,9 L20,6.5 C20,5.67157288 19.3284271,5 18.5,5 L16,5 L16,9 L20,9 Z M5.5,4 L18.5,4 C19.8807119,4 21,5.11928813 21,6.5 L21,17.5 C21,18.8807119 19.8807119,20 18.5,20 L5.5,20 C4.11928813,20 3,18.8807119 3,17.5 L3,6.5 C3,5.11928813 4.11928813,4 5.5,4 Z",
    },

    /**
     * Resize延迟时间（毫秒）。
     * 当容器改变大小后，延迟一定时间对chart进行重绘。
     */
    resizeDelay: 100,

    /**
     * 用于图表标记的配置。
     */
    mark: {
        series: {
            z: 0,
            name: "标注",
            type: "mark",
            color: "#333"
        },
        shape: {
            symbol: {
                label: {
                    fill: "#fff",
                    borderWidth: 1,
                    borderRadius: 20,
                    padding: [2, 4, 0, 4],
                    fontSize: 12,
                }
            },
            index: {
                lineStyle: {
                    lineDash: [6, 6, 6],
                    lineWidth: 1,
                    opacity: 0.9
                },

            },
            rect: {},
            line: {
                itemStyle: {
                    stroke: "red",
                    lineWidth: 1,
                    lineDash: [6]
                }
            },
            text: {
                label: {
                    fill: "red",
                    align: "center",
                    fontSize: 12,
                }
            }
        },
        /**
         * 用于编辑点的配置。
         * 因为左右标记的参数不一样，因此，设置两个标记配置：第一个为左边标记配置，第二个为右边标记配置。
         */
        side: [
            {
                symbol: "M195.5,18H10.85l8.5-16.55A1,1,0,0,0,18.46,0H1A1,1,0,0,0,.11,1.45l8.73,17a1,1,0,0,0,1,.53H195.5a.5.5,0,0,0,.5-.5A.5.5,0,0,0,195.5,18Z",
                itemStyle: {
                    scale: [0.8, 0.8],
                    offset: [-7, -14],
                },
                label: {
                    offset: [12, -15],
                    align: "left",
                }
            },
            {
                symbol: "M.5,18H185.15l-8.5-16.55A1,1,0,0,1,177.54,0H195a1,1,0,0,1,.89,1.45l-8.73,17a1,1,0,0,1-1,.53H.5a.5.5,0,0,1-.5-.5A.5.5,0,0,1,.5,18Z",
                itemStyle: {
                    scale: [0.8, 0.8],
                    offset: [-68, -14.5],
                },
                label: {
                    offset: [69, -15],
                    align: "right"
                }
            }
        ]
    },
    /**
     * 全局（默认）tooltip提示信息（组装）。
     * @param items
     */
    tooltip: items => {
        let content = items
            .map(e => `<li>${e.marker}<i>${e.seriesName}</i><i>${e.value[e.encode.y[0]] || "-"}</i></li>`)
            .join("");
        return `<article class="tooltip"><fieldset><legend>${items[0].axisValueLabel}</legend>${content}</fieldset></article>`;
    }
};
//@formatter:on

/**
 * 原生eCharts配置信息。用于全局所有eChart图表，更改此配置将会影响所有图表。
 */
export const options = {
    // 图表数据导出配置
    $export: {
        // 导出的文件名
        file: undefined,
        // 工作表名
        sheet: undefined,
        // 是否阻止默认导出
        prevent: false,
    },
    color: config.color,
    toolbox: {
        show: false,
        top: 5,
        right: 0,
        height: 30,
        itemSize: 20,
        feature: {
            saveAsImage: {
                title: "保存到图片",
            },
        },
    },
    tooltip: {
        formatter: config.tooltip,
        className: "tooltip-container",
    },
    dataset: {
        sourceHeader: false,
        source: [],
    },
    axisPointer: {
        shadowStyle: {
            color: "#fff",
        },
    },
    // yAxis:[{
    //   // 设置哪些series可以使用此轴数据
    //   $layout: CATEGORY.RAINFALL,
    // }],
    series: null,
    // series:[{
    //   // $code为series代码，由于已提供的图表是高度定制化的，因此series也是确定的，
    //   // 为了确保已定义的series和dimension里面的数据一致，因此需提高code以指定
    //   // dimensions里面数据所使用的series。
    //   // 即dimensions里面每一项的code与某series的$code一致方可使用series的配置
    //   $code:CATEGORY.RAINFALL,
    // }]
};

export const axis = {
    axisLine: {show: true},
    axisLabel: {},
    axisTick: {},
    splitLine: {},
};

//@formatter:off
/**
 * 定义各系列的代码（如流量、水位、降雨量等），以方便安排各系列的位置或配置属性。
 * 在eCharts的options.yAxis配置中的$layout属性以指示那些系列可以使用此轴（多个系列用‘|’链接），例如：
 * <pre>
 *   xAxis:{
 *     $layout:CATEGORY.FLOW | CATEGORY.SWC
 *   }
 * </pre>
 * 则表示流量和土壤含水量可以使用此轴。
 */
export const CATEGORY = {
    RAINFALL: 1 << 0,   //降雨量1
    STAGE: 1 << 1,   //水位曲线2
    FLOW: 1 << 2,   //流量曲线4
    CAPACITY: 1 << 3,   //库容曲线8
    SWC: 1 << 4,   //土壤含水量16
    OTHER: 1 << 30,  //其他类型1073741824

    // 适用于任何类别
    TOP_LEFT: 1 << 0,   //左上
    TOP_RIGHT: 1 << 1,   //右上
    MIDDLE_LEFT: 1 << 2,   //左中
    MIDDLE_RIGHT: 1 << 3,   //右中
    BOTTOM_LEFT: 1 << 4,   //左下
    BOTTOM_RIGHT: 1 << 5,   //右下
};
//@formatter:on

/**
 * 定义“大坝示意图”、“断面示意图”等的点类型与使用图标的映射关系。
 */
export const TYPE_SYMBOL = {
    top: "altitude",        //坝顶高程
    bottom: "altitude",     //坝底高程
    under: "stage",         //坝下水位
    current: "stage",       //当前水位
};

/**
 * 对全局配置信息及Chart组件的options进行全局配置，新的参数将于旧的参数进行合并。
 * @param newConfig {Object}  全局配置对象.
 * @param newOptions {Object} 全局eChart options对象.
 */
export function setup(newConfig, newOptions) {
    assign(config, newConfig);
    assign(options, newOptions);
}

export default config;

